---
kind: property
id: P:Autodesk.Revit.DB.PrimarySizeCriterion.MaximumSize
source: html/fba78904-560e-1536-d0fc-cbd8ac1e25f0.htm
---
# Autodesk.Revit.DB.PrimarySizeCriterion.MaximumSize Property

The maximum size of this criterion.

## Syntax (C#)
```csharp
public double MaximumSize { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.DisabledDisciplineException** - When setting this property: None of the following disciplines is enabled: Mechanical Electrical Piping.